import os

mission1 = """
Προγραμματίστε ένα απλό Chatbot
1.	Ρωτήστε τον χρήστη το όνομα του και χαιρετήστε τον με αυτό το όνομα. 
2.	Ρωτήστε τον την τωρινή μέρα και ώρα και τυπώστε ένα μήνυμα στην οθόνη
3.	Ρωτήστε τον την αγαπημένη του δραστηριότητα ή φαγητό και τυπώστε τα στην οθόνη μαζι με ένα μήνυμα """

mission2 = """Φτιάξτε πρόγραμμα να δέχεται δύο αριθμούς και να επιστρέφει το άθροισμα και το γινόμενό τους (μαζί με κείμενο)"""

mission2_5 = """Το ίδιο με την 4 αλλά για πολλούς αριθμούς (>5). Προφανώς υπάρχει απλή λύση!
Μπορείτε να ψάξετε και στο internet How to find max of x numbers python"""

mission3 = """Φτιάξτε ένα πρόγραμμα οπου θα πρέπει ο χρήστης να δίνει το όνομα του και την ηλικία του. 
    Αν ειναι μεγαλύτερος από 15 χρονών θα πρέπει το πρόγραμμα να τερματίζει 
    με αντιστοιχο μήνυμα όπου θα δείχνει την ηλικία και το ονομα του χρήστη 
    πχ. Σόρρυ Λάκη είσαι πολύ μεγάλος!

    Αν ειναι μικρότερο από 15 θα πρέπει αν τον καλωσορίζει στην ομάδα. 
    πχ Γεια σου μέγα Λάκη! Καλως μας ήρθες"""

mission4 = """Ο χρήστης να δίνει παραπάνω από 2 αριθμούς και το πρόγραμμα μας επιστρέφει το μεγαλύτερο απο αυτούς"""

while True:
    try:
        mission = float(input("Αποστολή?? "))
        if mission == 1:
            print("Mission 1 selected")
            print("#" * 40)
            print(mission1)
            print("#" * 40 + "\n")
        elif mission == 2:
            print("Mission 2 selected")
            print("#" * 40)
            print(mission2)
            print("#" * 40 + "\n")
        elif mission == 2.5:
            print("Mission 2.5 selected")
            print("#" * 40)
            print(mission2_5)
            print("#" * 40 + "\n")
        elif mission == 3:
            print("Mission 3 selected")
            print("#" * 40)
            print(mission3)
            print("#" * 40 + "\n")
        elif mission == 4:
            print("Mission 4 selected")
            print("#" * 40)
            print(mission4)
            print("#" * 40 + "\n")
    except KeyboardInterrupt:
        print("\nΟ χρήστης διέκοψε την εκτέλεση.")
        break
    except ValueError:
        print("Παρακαλώ εισάγετε έναν αριθμό.")


